// 3.小宇在網路上訂高鐵，一張高鐵票1415元，先輸入密碼:7414，若輸入錯誤則顯示密碼錯誤且程式中止。'
// 輸入正確後選擇票種:早鳥票輸入1;全票輸入2;學生票輸入3，再選擇座位:自由座輸入4、對號座輸入5。
// 最後小宇需要付多少錢。(輸入相關數值由教師指定)。40%
// 選擇票種
// 輸入	票種	優惠
// 1	早鳥票	打65折
// 2	全票	無優惠
// 3	學生票	打88折
// 選擇座位
// 4	自由座	不加錢
// 5	對號座	加20元
#include <stdio.h>
int main()
{
    int password, ticket, seat; // 定義密碼，票種，座位
    float pay;                  // 定義多少錢依照題意會有小數點
    printf("請輸入密碼\n");
    scanf("%d", &password);
    // 管制關卡
    if (password != 7414) // 如果答案不等於7414
    {
        printf("密碼錯誤\n");
        return 0; // 程式結束
    }
    printf("密碼正確\n請選擇票種:早鳥票輸入1;全票輸入2;學生票輸入3\n");
    scanf("%d", &ticket); // 輸入票種
    printf("請選擇座位:自由座輸入4、對號座輸入5\n");
    scanf("%d", &seat); // 輸入座位
    // 判斷式
    if (ticket == 1) // 票種全等於1
    {
        printf("早鳥票 ");
    }
    else if (ticket == 2) // 票種全等於2
    {
        printf("全票 ");
    }
    else if (ticket == 3) // 票種全等於3
    {
        printf("學生票 ");
    }
    // 以上先輸出所輸入的票種//
    // 以下驗證輸入的票種及座位算出價格//
    if (ticket == 1 && seat == 4) // 票種全等於1 且 座位全等於4
    {
        pay = 1415 * 0.65;          // 早鳥65折
        printf("自由座%0.2f", pay); //%0.2f即小數點後兩位//前面已輸出票種在輸出座位
        return 0;                   // 程式結束
    }
    else if (ticket == 1 && seat == 5) // 票種全等於1 且 座位全等於5
    {
        pay = 1415 * 0.65 + 20;     // 早鳥65折+20元指定席
        printf("對號座%0.2f", pay); // 前面已輸出票種在輸出座位
        return 0;                   // 程式結束
    }
    else if (ticket == 2 && seat == 4) // 票種全等於2 且 座位全等於4
    {
        pay = 1415;                 // 全票原價
        printf("自由座%0.2f", pay); // 前面已輸出票種在輸出座位
        return 0;                   // 程式結束
    }
    else if (ticket == 2 && seat == 5) // 票種全等於2 且 座位全等於5
    {
        pay = 1415 + 20;            // 全票原價+20元指定席
        printf("對號座%0.2f", pay); // 前面已輸出票種在輸出座位
        return 0;                   // 程式結束
    }
    else if (ticket == 3 && seat == 4) // 票種全等於3 且 座位全等於4
    {
        pay = 1415 * 0.88;          // 學生票88折
        printf("自由座%0.2f", pay); // 前面已輸出票種在輸出座位
        return 0;                   // 程式結束
    }
    else if (ticket == 3 && seat == 5) // 票種全等於3 且 座位全等於5
    {
        pay = 1415 * 0.88 + 20;     // 學生票+指定席
        printf("對號座%0.2f", pay); // 前面已輸出票種在輸出座位
        return 0;                   // 程式結束
    }
}