// 2.小騰在加水站加水，該加水站是以公升來計算
// 前10公升不論加多少都是20元，之後根據公升數每公升金額不同如下。小騰加了X公升，那他需要付多少錢?(輸入相關數值由教師指定)。30%
// 11~15公升 每公升8元
// 16~22公升 每公升6元
// 23~28公升 每公升4元
// 29公升以上 每公升2元
#include <stdio.h>
int main()
{
    int add_L, pay; // 定義增加的公升add_L 和付的錢該題沒有小數點
    printf("請輸入加入的公升數(僅取整數位)\n");
    scanf("%d", &add_L); // 從鍵盤輸入公升數
    // 判斷式
    if (add_L <= 10) // 小於等於10
    {
        pay = 20; // 直接輸出20元
        printf("%d元\n", pay);
    }
    else if (add_L >= 11 && add_L <= 15) // 11~15
    {
        pay = 20 + (add_L - 10) * 8; // 至少20元+(多出來的公升-10)*8元
        printf("%d元\n", pay);
    }
    else if (add_L >= 16 && add_L <= 22) // 16~22
    {
        pay = 20 + 5 * 8 + (add_L - 15) * 6; // 至少20元+(15-10)*8元+(多出來的公升-15)*6元
        printf("%d元\n", pay);
    }
    else if (add_L >= 23 && add_L <= 28) // 23~28
    {
        pay = 20 + 5 * 8 + 7 * 6 + (add_L - 22) * 4; // 至少20元+(15-10)*8元+(22-15)*6元+(多出來的公升-22)*4元
        printf("%d元\n", pay);
    }
    else if (add_L >= 29) // 29~
    {
        pay = 20 + 5 * 8 + 7 * 6 + 6 * 4 + (add_L - 28) * 2; // 至少20元+(15-10)*8元+(22-15)*6元+(28-22)*4元+(多出來的公升-28)*2元
        printf("%d元\n", pay);
    }
}