#include <stdio.h>
int main()
{
    int buy, pay, balance, s500, r500, s100, r100, s50, r50, s10, r10, s5, r5;
    printf("請輸入購物金額、付現、建立找零系統\n");
    scanf("%d %d", &buy, &pay); // 23 1000
    balance = pay - buy;        // 1000-23=973
    if (balance >= 0)
    {
        s500 = balance / 500; // 500元找幾張 973/500=1
        r500 = balance % 500; // 找完500後的餘數 973-500=473
        s100 = r500 / 100;    // 100元找幾張 473/100=4
        r100 = r500 % 100;    // 找完100後的餘數 473-400=73
        s50 = r100 / 50;      // 50元找幾個 73/50=1
        r50 = r100 % 50;      // 找完50的餘數 73-50=23
        s10 = r50 / 10;       // 10元找幾個 23/10=2
        r10 = r50 % 10;       // 找完10後的餘數 23-20=3
        s5 = r10 / 5;         // 5元找幾個 3/5=0
        r5 = r10 % 5;         // 找完5的餘數 又稱為剩下的1元
        printf("買了:%d元，付了:%d，找零%d元，如下:500-%d,,100-%d,,50-%d,,10-%d,,5-%d,,1-%d\n", buy, pay, balance, s500, s100, s50, s10, s5, r5);
    }
    else
    {
        printf("付現:%d元，不足以支付購物金額:%d\n", pay, buy);
    }
}